app/Service/Real/DbPlantService.php

select * from `plant` order by `name` asc
---
    public function getAllPlants(): array
    {
        echo("<script>console.log('getAllPlants');</script>");

        $dbData = DbPlant::with('tags')->orderBy('name')->get();

select * from `plant` where `id` = 14 limit 1
---
    public function getPlant(int $id): PlantFull
    {
        echo("<script>console.log('getPlant');</script>");

        $dbItem = DbPlant::with('tags')->where('id', $id)->first();

select count(*) as aggregate from `user_plant` where `user_id` = 1 and `plant_id` = 14
---
    public function addPlantToFavor(int $userId, int $plantId)
    {
        echo("<script>console.log('addPlantToFavor');</script>");
        if (DbUserPlant::where('user_id', $userId)->where('plant_id', $plantId)->count() > 0)

select * from `plant` where `plant`.`id` in (1, 6, 14)
---
    public function getFavorPlants(int $userId): array
    {
        echo("<script>console.log('getFavorPlants');</script>");
        $dbData = DbUserPlant::with("plant")->where('user_id', $userId)->get();

select * from `plant` where `plant`.`id` in (1, 6, 14)
select * from `action` where `id` = 1 limit 1
select * from `action` where `id` = 2 limit 1
select * from `action` where `id` = 3 limit 1
select * from `plant_user_done` where `user_id` = 1 and `plant_id` = 6 and `action_id` = 1 and `date` = '2021-06-03 00:00:00' limit 1
---
    public function getFavorCalendar(int $userId): array
    {
        echo("<script>console.log('getFavorCalendar');</script>");
        $dbData = DbUserPlant::with("plant")->where('user_id', $userId)->get();
        $dataPlant = [];
        foreach ($dbData as $dbItemUserPlant) {
            $dataPlant[] = $this->getPlantFromDbPlant($dbItemUserPlant['plant']);
        }
        $date = [];
        $begin = new DateTime('first day of this month');
        date_time_set($begin,0,0,0);
        $end = new DateTime('last day of this month');
        $totalDays = $end->diff($begin)->d+1;
        $actionWatering = DbAction::where('id', 1)->first();
        $actionManuring = DbAction::where('id', 2)->first();
        $actionPesting = DbAction::where('id', 3)->first();

        for ($day = 1; $day <= $totalDays; $day++) {
            $item = new CalendarPlant();
            $item->dayNum = $day;
            $item->date = date_format($begin,'Y-m-d');
            $item->dayInfo = date_format($begin,'d.m');
            $item->plantsToDo = [];
            foreach ($dataPlant as $plant){
                if( $plant->wateringDays > 0 && $day % $plant->wateringDays === 0) {
                    $toDo = new CalendarPlantRow();
                    $toDo->plant = $plant;
                    $toDo->action = $actionWatering;
                    $toDo->done = DbPlantUserDone::where('user_id', $userId)->where('plant_id',$plant->id)->where('action_id',1)->where('date',$begin)->first() !== null;

select * from `plant_user_done` where `user_id` = 1 and `plant_id` = 1 and `action_id` = 2 and `date` = '2021-06-01 00:00:00' limit 1
---
                    $toDo = new CalendarPlantRow();
                    $toDo->plant = $plant;
                    $toDo->action = $actionManuring;
                    $toDo->done = DbPlantUserDone::where('user_id', $userId)->where('plant_id',$plant->id)->where('action_id',2)->where('date',$begin)->first() !== null;

select * from `plant_user_done` where `user_id` = 1 and `plant_id` = 1 and `action_id` = 3 and `date` = '2021-06-05 00:00:00' limit 1
---
                    $toDo = new CalendarPlantRow();
                    $toDo->plant = $plant;
                    $toDo->action = $actionPesting;
                    $toDo->done = DbPlantUserDone::where('user_id', $userId)->where('plant_id',$plant->id)->where('action_id',3)->where('date',$begin)->first() !== null;

select * from `user_plant` where `user_id` = 1 and `plant_id` = 1 limit 1
---
    private function getPlantFromDbPlant(DbPlant $dbPlant): PlantShort
    {
        $item = new PlantShort();
        $item->id = $dbPlant['id'];
        $item->name = $dbPlant['name'];
        $item->addDate = \DateTime::createFromFormat('Y-m-d', $dbPlant['add_date'])->format('d.m.Y');
        $item->shortInfo = $dbPlant['short_info'];
        $item->photoSmallPath = $dbPlant['photo_small_path'];
        $item->wateringDays = $dbPlant['watering_days'];
        $item->manuringDays = $dbPlant['manuring_days'];
        $item->pestControlDays = $dbPlant['pest_control_days'];
        $tags = [];
        foreach ($dbPlant['tags'] as $dbTag)
            $tags[] = $dbTag['tag'];
        $item->tags = implode(", ", $tags);
        $item->isFavor = DbUserPlant::where('user_id', 1)->where('plant_id', $item->id)->first() !== null;